## 라이브러리 선언

In [1]:
import pandas as pd

In [2]:
import numpy as np

## 데이터 불러오기

In [3]:
selloutData=pd.read_csv("./dataset/kopo_channel_seasonality_new.csv")
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [4]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

## 데이터 통합

In [6]:
selloutData["REGIONID"]=selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"]=selloutData["PRODUCT"].astype(str)
selloutData["YEARWEEK"]=selloutData["YEARWEEK"].astype(str)
selloutData["QTY"]=selloutData["QTY"].astype(float)

In [7]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

## 불량데이터처리-반품값정제

In [8]:
selloutData["QTY_NEW"]=np.where(selloutData["QTY"]<0,0,selloutData["QTY"])

In [9]:
len(selloutData)

124658

In [11]:
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW
0      A60   PRODUCT4   201402     71.0     71.0
1      A60  PRODUCT59   201402  22275.0  22275.0
2      A60  PRODUCT34   201402   4463.0   4463.0
3      A60  PRODUCT47   201402      0.0      0.0
4      A60  PRODUCT56   201402     23.0     23.0

## 불량데이터처리-53주차제거

In [12]:
selloutData["YEAR"]=selloutData.YEARWEEK.astype(str).str[0:4]
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR
0      A60   PRODUCT4   201402     71.0     71.0  2014
1      A60  PRODUCT59   201402  22275.0  22275.0  2014
2      A60  PRODUCT34   201402   4463.0   4463.0  2014
3      A60  PRODUCT47   201402      0.0      0.0  2014
4      A60  PRODUCT56   201402     23.0     23.0  2014

In [13]:
selloutData["WEEK"]=selloutData.YEARWEEK.astype(str).str[4:]
selloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

In [14]:
refinedSelloutData=selloutData[selloutData.WEEK.astype(int)<=52]

In [15]:
len(refinedSelloutData)

123864

In [16]:
refinedSelloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

## 데이터정렬/집계

In [19]:
sortkey=["REGIONID","PRODUCT","YEARWEEK"]

In [20]:
sortedData=refinedSelloutData.sort_values(sortkey)
sortedData.head()

     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
298       A00  PRODUCT34   201401  661.0    661.0  2014   01
1757      A00  PRODUCT34   201402  679.0    679.0  2014   02
3125      A00  PRODUCT34   201403  578.0    578.0  2014   03
205       A00  PRODUCT34   201404  532.0    532.0  2014   04
4369      A00  PRODUCT34   201405  516.0    516.0  2014   05

### 기존 인덱스를 drop하고 새로 인덱스를 생성

In [21]:
sortedData=sortedData.reset_index(drop=True)
sortedData.head()

  REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
0      A00  PRODUCT34   201401  661.0    661.0  2014   01
1      A00  PRODUCT34   201402  679.0    679.0  2014   02
2      A00  PRODUCT34   201403  578.0    578.0  2014   03
3      A00  PRODUCT34   201404  532.0    532.0  2014   04
4      A00  PRODUCT34   201405  516.0    516.0  2014   05